SET NAMES 'utf8mb4';
-- CREATE the urgent case table
CREATE TABLE IF NOT EXISTS urgent_case
(
    urgent_id   INT          NOT NULL AUTO_INCREMENT,
    urgent_name VARCHAR(255) NOT NULL,
    urgency_id  INT          NOT NULL,
    animal_id   INT          NOT NULL,
    PRIMARY KEY (urgent_id),
    CONSTRAINT UC_Urgent UNIQUE (urgent_name, animal_id),
    CONSTRAINT FK_UrgencyUrgent FOREIGN KEY (urgency_id) REFERENCES urgency (urgency_id) ON DELETE CASCADE,
    CONSTRAINT FK_AnimalUrgent FOREIGN KEY (animal_id) REFERENCES animal (animal_id) ON DELETE CASCADE,
    INDEX idx_urgent_name (urgent_name)
) CHARACTER SET utf8mb4
  COLLATE utf8mb4_unicode_ci;

-- Insert mock data into the urgent_case table
INSERT INTO urgent_case (urgent_name, urgency_id, animal_id)
VALUES -- ฉุกเฉินถึงแก่ชีวิต สุนัข
       ('หัวใจหยุดเต้น', 1, 1),
       ('หมดสติ', 1, 1),
       ('ไม่หายใจ', 1, 1),
       ('ช่องอกทะลุ', 1, 1),
       ('ชักมากกว่า 3 - 5 ครั้ง/วัน', 1, 1),
       ('หายใจไม่ออก', 1, 1),
       ('เยื่อเมือกสีคล้ำ', 1, 1),
       ('ฉี่เป็นเลือดสด/ฉี่เป็นเลือดทั้งกอง สัตว์อยู่ในภาวะซึม', 1, 1),
       ('ฉี่เป็นหยด เข้าห้องน้ำบ่อย บางครั้งฉี่แต่ไม่มีอะไรออกมา', 1, 1),
       ('ไม่เห็นฉี่เลยเกิน 12 ชั่วโมง', 1, 1),
       ('ประสบอุบัติเหตุแล้วไม่เห็นปัสสาวะเลย หรือสงสัยกระเพาะและท่อปัสสาวะฉีกขาด', 1, 1),
       -- ฉุกเฉินเร่งด่วน สุนัข
       ('ช็อก ขาดน้ำอย่างรุนแรง', 2, 1),
       ('ได้รับสารพิษ งูกัด', 2, 1),
       ('กระเพาะอาหารบิด', 2, 1),
       ('ช่องท้องทะลุ', 2, 1),
       ('อุนณหภูมิร่างกายสูงกว่า 105° F', 2, 1),
       ('ภาวะเสียเลือดอย่างรุนแรง', 2, 1),
       ('โลหิตจางรุนแรง', 2, 1),
       ('คลอดไม่ออก', 2, 1),
       ('กระดูกหักหลายตำแหน่ง', 2, 1),
       -- ฉุกเฉิน (ไม่รุนแรง) สุนัข
       ('ปัสสาวะไม่ออก', 3, 1),
       ('เลือดกำเดาไหล', 3, 1),
       ('แผลจากอุบัติเหตุ', 3, 1),
       ('กระดูกหักทะลุออกนอกร่างกาย', 3, 1),
       ('ถ่ายเหลว หรืออาเจียนมากกว่า 4 - 5 ครั้ง/วัน', 3, 1),
       ('อวัยวะทะลักออกนอกร่างกาย', 3, 1),
       -- ไม่ฉุกเฉิน สุนัข
       ('ถ่ายไม่ออก', 4, 1),
       ('ไอ หอบ', 4, 1),
       ('อ่อนแรง', 4, 1),
       ('มาไม่ทันนัด', 4, 1),
       ('ซึม ไม่ทานอาหาร', 4, 1),
       ('วัคซีน', 4, 1),
       -- ฉุกเฉินถีงแก่ชีวิต แมว
       ('หัวใจหยุดเต้น', 1, 2),
       ('หมดสติ', 1, 2),
       ('ไม่หายใจ', 1, 2),
       ('ช่องอกทะลุ', 1, 2),
       ('ชักมากกว่า 3 - 5 ครั้ง/วัน', 1, 2),
       ('หายใจไม่ออก', 1, 2),
       ('เยื่อเมือกสีคล้ำ', 1, 2),
       ('ฉี่เป็นเลือดสด/ฉี่เป็นเลือดทั้งกอง สัตว์อยู่ในภาวะซึม', 1, 2),
       ('ฉี่เป็นหยด เข้าห้องน้ำบ่อย บางครั้งฉี่แต่ไม่มีอะไรออกมา', 1, 2),
       ('ไม่เห็นฉี่เลยเกิน 12 ชั่วโมง', 1, 2),
       ('ประสบอุบัติเหตุแล้วไม่เห็นปัสสาวะเลย หรือสงสัยกระเพาะและท่อปัสสาวะฉีกขาด', 1, 2),
       -- ฉุกเฉินเร่งด่วน แมว
       ('ช็อก ขาดน้ำอย่างรุนแรง', 2, 2),
       ('ได้รับสารพิษ งูกัด', 2, 2),
       ('กระเพาะอาหารบิด', 2, 2),
       ('ช่องท้องทะลุ', 2, 2),
       ('อุนณหภูมิร่างกายสูงกว่า 105° F', 2, 2),
       ('ภาวะเสียเลือดอย่างรุนแรง', 2, 2),
       ('โลหิตจางรุนแรง', 2, 2),
       ('คลอดไม่ออก', 2, 2),
       ('กระดูกหักหลายตำแหน่ง', 2, 2),
       -- ฉุกเฉิน (ไม่รุนแรง) แมว
       ('ปัสสาวะไม่ออก', 3, 2),
       ('เลือดกำเดาไหล', 3, 2),
       ('แผลจากอุบัติเหตุ', 3, 2),
       ('กระดูกหักทะลุออกนอกร่างกาย', 3, 2),
       ('ถ่ายเหลว หรืออาเจียนมากกว่า 4 - 5 ครั้ง/วัน', 3, 2),
       ('อวัยวะทะลักออกนอกร่างกาย', 3, 2),
       -- ไม่ฉุกเฉิน แมว
       ('ถ่ายไม่ออก', 4, 2),
       ('ไอ หอบ', 4, 2),
       ('อ่อนแรง', 4, 2),
       ('มาไม่ทันนัด', 4, 2),
       ('ซึม ไม่ทานอาหาร', 4, 2),
       ('วัคซีน', 4, 2);

